####################
#1
# a = [2,7,4,9,1,4]

# for i in a :
#     if i==4:
#         print('Выводим число{}'.format (i))
####################
# #2
# a = [2,7,4,9,1,4]

# for i in a :
#     print(i)

#####################
#3

# a = [2,7,4,9,1,4]

# for i in a :
#     if i%3 ==0 :
#         print ('Это число делиться на 3.Число = {i}' .format(i=i))

######################   
# 4
# a = [2,7,4,9,1,4]     
# for i in a :
#     if i > 5 :
#     # print('Это числа больше 5'(i))#### Почему эта конструция не сработала ) 
#         print(i)

######################
# 5
i = 0 
while i < 10:
    print(i*5)
    i=i + 1

######################


    