#########################################
#1
# Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран

# def action():
#     for i in range (1 , 100):
#         # print(i)   
#         z = i +(i + 1) 
#         print(z)

# action ()

#############################################
#2
#Вывести на экран все чётные значения в диапазоне от 1 до 497

# def action ():
#     for i in range (1 , 497 ):
#         if i % 2 == 0 :
#             print(i)


# action ()
###############################################
#3
#Перемножить все не чётные значения в диапазоне от 0 до 9435;

# def action ():
#     for i in range (0 , 9435):
#         if i % 3 == 0:
#             # print(i)
#             z = i * (i + 1)  
#             print(z)    

# action()   

###################################################
#4
# Записать в массив все числа в диапазоне от 54 до 9184 кратные 5

# def action ():
#     for i in range (54 , 9184):
#         if i % 5 == 0 :
#             print(i)


# action()
######################################################

# def action ():
#     A = [ for i in range(N)] :
#     if A % 5 == 0 :
#     print(A)


# N = 9184

# action()
###########################
#5
# найти числа у которых 5 делителей ( числа в промежутке 23000 до 23500 ) и вывести эти числа
def action ():
    for i in range (23000 ,23500 ):
        
  
    

action()    

