####################################
#1
# def action (a):
#     c = a + 100 * 5
#     print(c)

# a = 50 

# action(a)


#######################################
#2
# def hello():
#     print("hello World")

# hello()


###########################################
#3




##############################################
#4



##############################################
#5
def action (i,end):
    if i <= end :
        print(i)
    else :
        print("Число не входит с диапозон ")    

end = 10 
i = int(input("Введите число из диопазона "))


action (i,end)



#############################################
#6



